
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/109naoki/rss-infra/actions/runs/8414531483)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-091f21a54fc911aba]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-08f057da2c1e6f29b]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0ff4b7cf67029f0dd]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-035cfa7d06994e758]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-046d00b4612d31901]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-07d1d80f0ed6bb932]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-019a1aa7d4f2158c2]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a8fdfa87f1df4d2c]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0559881d84db86322]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-023ebf38354652734]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-048af904a6d32cb40]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0f0375cca0d460ec1]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-07591b3e6fbcf480f]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0f6bab745980dd060]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0559881d84db863221080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0654f69cb494833ec]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c1514818bf88c6c9]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b8866ccab1204bb6]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07e39ac159916c26b]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0171619a4015cf390]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-028455c38671132b7]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-07d1d80f0ed6bb9321080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-046d00b4612d319011080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "For ALB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to Outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from ALL"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "go-rss-server-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-rss-server-alb"
        }
      + tags_all               = {
          + "Name" = "go-rss-server-alb"
        }
      + vpc_id                 = "vpc-091f21a54fc911aba"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "For ECS"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to Outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "go-rss-server-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-rss-server-ecs"
        }
      + tags_all               = {
          + "Name" = "go-rss-server-ecs"
        }
      + vpc_id                 = "vpc-091f21a54fc911aba"
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow 8080 from Security Group for ALB."
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.ecs: Creating...
aws_security_group.alb: Creating...
aws_security_group.ecs: Creation complete after 2s [id=sg-0c52d53b99ba37ca7]
aws_security_group.alb: Creation complete after 2s [id=sg-02ec66d913b4fb6e9]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-2882790752]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":2,"Program":"tfcmt","SHA1":"f481eb24d634befb1cdb414a645de49606f9d294","Vars":{},"WorkflowName":"Terraform"} -->